#Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами,
# що випали випадковим чином і в певному діапазоні під час чергового тиражу.
# Наприклад, необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.
#Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), 
#яка допоможе генерувати набір унікальних випадкових чисел для таких лотерей.
#Вона буде повертати випадковий набір чисел у межах заданих параметрів,
#  причому всі випадкові числа в наборі повинні бути унікальні.
#Вимоги до завдання:
#Параметри функції:
#min - мінімальне можливе число у наборі (не менше 1).
#max - максимальне можливе число у наборі (не більше 1000).
#quantity - кількість чисел, які потрібно вибрати (значення між min і max).
#Функція генерує вказану кількість унікальних чисел у заданому діапазоні.
#Функція повертає список випадково вибраних, відсортованих чисел. Числа в наборі не повинні повторюватися. 
#Якщо параметри не відповідають заданим обмеженням, функція повертає пустий список.



import random

def get_numbers_ticket(min, max, quantity):
        # Створюю генератор виграших чисел
        roll = 0
        winner_numders = []
        while roll < quantity:
            roll += 1
            winner_numder = random.randint(min, max)
            winner_numders.append(winner_numder)
        
        return sorted(winner_numders)

# Перевіряю виконання умов задачі    
try:
    min = int(input("Введіть мінімальне значення: "))
    max = int(input("Введіть максимальне значення: "))
    quantity = int(input("Скільки буде виграшних білетів?: "))

    if min > quantity < max:
        print("Кількість унікальних чисел більша за діапазон.")
    elif min < 0 and max > 1001:
        print("Не вірні границі значень, встановіть значення від 1 до 1000")

    else:
        lottery_numbers = get_numbers_ticket(min, max, quantity)
        print("Ваші лотерейні числа:", lottery_numbers)
except ValueError:
    print("Введіть коректні числові значення.")

